app/Controllers/Alumno.php

SELECT *
FROM `Alumno`
WHERE `Alumno`.`deleted_at` IS NULL
---
    public function mostrar(){
        $alumnoModel = model('AlumnoModel');

        $data['alumnos'] = $alumnoModel->findAll();

SELECT *
FROM `grados`
SELECT *
FROM `grupos`
---
    public function agregar(){
        helper(['form','url']);
        $gradoModel = model('GradoModel');
        $grupoModel = model('GrupoModel');

        $data['grados'] = $gradoModel->findAll();
        $data['grupos'] = $grupoModel->findAll();

INSERT INTO `Alumno` (`nombre`, `sexo`, `fechaNacimiento`, `idGrado`, `idGrupo`) VALUES ('', 'Hombre', '', '1', '1')
---
    public function insert(){
        $alumnoModel = model('AlumnoModel');
        $data = [
            "nombre" => $_POST['nombre'],
            "sexo" => $_POST['sexo'],
            "fechaNacimiento" => $_POST['fechaNacimiento'],
            "idGrado" => $_POST['idGrado'],
            "idGrupo" => $_POST['idGrupo']
        ];
        $alumnoModel->insert($data, false);